{
  "results": [{
    "id": "db-security",
    "title": "Существует ли абсолютная защита баз данных?",
    "content": "Автор не является профессионалом в области защиты баз данных. Поэтому заранее просит не судить его строго. Если в рассуждениях допущена ошибка и предложенная схема не работает, автор с благодарностью примет замечание. А также автор просит извинить, если предложенная схема окажется чем-то банальным и уже давно используемым.\n\nВ настоящий момент я не возьмусь утверждать существует ли абсолютная защита базы данных от нежелательного просмотра. Допускаю, что она может оказаться в принципе не достижимой. В отличие от этого, абсолютная защита базы данных от нежелательного изменения существует. Более того, техническая реализация такой защиты довольно проста, что позволяет применять ее в любых базах данных.\n\nЧто я имею ввиду, когда говорю об абсолютной защите базы данных от нежелательных изменений. Это такая организация работы с базой данных, которая исключает возможность внести в базу данных изменения незаметно для контролера.\n\nЗа 25 лет работы с учетными системами я повидал наверное больше сотни различных информационных баз. И могу сказать, что ни в одной из них такой защиты не было. Да, есть конечно журналы транзакции, версионирование но... Пользователь, получивший так или иначе соответствующие права и доступ к базе данных может заменить в каком-нибудь более или менее древнем документе прихода\n\n10 шт. Х 1 руб.\n\nна\n\n1 шт. Х 10 руб.\n\nИ сделать это так, что никаких записей в журнале транзакций или в истории изменения данных не появится. Там нет никакой магии. Это всего лишь записи. Такие же, как в основной базе.\n\nМожет ли рядовой пользователь базы данных противостоять пользователю, который получил \"режим бога\"? Ответ: да, может. Для этого нам надо дать ему возможность получить доказательство неизменности данных. \n\n <a href=`https://habr.com/ru/post/703264/`>Продолжение статьи</a>",
    "image": "https://www.klubok.net/wp-content/uploads/2020/11/43383969-90c9-43a8-a5e1-258e278275c3.jpg.850x445_q82_crop1.jpg",
    "meta": {
      "description": "Информационная безопасность",
      "published": "2022-12-06T14:54:00Z",
      "author": "exwill"
    }
  }]
}
